Akustik13/beacon-30mhz/BLE_HR_p2p_Sensor/STM32_WPAN/App/app_ble.c
  udn = LL_FLASH_GetUDN();

  if (udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

    /**
     * Public Address with the ST company ID
     * bit[47:24] : 24bits (OUI) equal to the company ID
     * bit[23:16] : Device ID.
     * bit[15:0] : The last 16bits from the UDN
     * Note: In order to use the Public Address in a final product, a dedicated
     * 24bits company ID (OUI) shall be bought.
     */
    a_BdAddrUdn[0] = (uint8_t)(udn & 0x000000FF);
    a_BdAddrUdn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
    a_BdAddrUdn[2] = (uint8_t)device_id;
    a_BdAddrUdn[3] = (uint8_t)(company_id & 0x000000FF);
    a_BdAddrUdn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
    a_BdAddrUdn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

    p_bd_addr = (const uint8_t *)a_BdAddrUdn;
  }
  else
  {
    p_otp_addr = OTP_Read(0);
    if (p_otp_addr)
    {
      p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
    }
    else
    {
      p_bd_addr = a_MBdAddr;
    }
  }

  return p_bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static void BLE_Led_Timer_Callback(void)
{
  /* Only drive LED from this timer in BLE_STATUS mode.
     In other modes (OFF, TX_PULSE, HEARTBEAT, ALWAYS_ON) the main loop or
     rf_enable() owns the LED — stop timer and leave LED alone. */
  if (g_config.led_mode != LED_BLE_STATUS) {
    Ble_Led_FastToggleCounter = 0U;
    HW_TS_Stop(Ble_Led_Timer_Id);
    return;
  }

  if (Ble_Led_FastToggleCounter > 0U)
  {
    BSP_LED_Toggle(LED_BLUE);
    Ble_Led_FastToggleCounter--;

    if (Ble_Led_FastToggleCounter == 0U)
    {
      BSP_LED_Off(LED_BLUE);
      HW_TS_Stop(Ble_Led_Timer_Id);

      if ((BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV) ||
          (BleApplicationContext.Device_Connection_Status == APP_BLE_IDLE))
      {
        BLE_Led_Start_Advertising_Blink();
      }
    }
  }
  else
  {
    BSP_LED_Toggle(LED_BLUE);
  }
}

static void BLE_Led_Start_Advertising_Blink(void)
{
  Ble_Led_FastToggleCounter = 0U;
  HW_TS_Stop(Ble_Led_Timer_Id);
  if (g_config.led_mode != LED_BLE_STATUS) return;
  BSP_LED_Off(LED_BLUE);
  HW_TS_Start(Ble_Led_Timer_Id, BLE_LED_ADV_BLINK_PERIOD);
}

static void BLE_Led_Start_Disconnect_Blink(void)
{
  HW_TS_Stop(Ble_Led_Timer_Id);
  if (g_config.led_mode != LED_BLE_STATUS) return;
  Ble_Led_FastToggleCounter = BLE_DISCONN_FAST_TOGGLES;
  BSP_LED_Off(LED_BLUE);
  HW_TS_Start(Ble_Led_Timer_Id, BLE_LED_FAST_BLINK_PERIOD);
}

static void BLE_Led_Set_Connected(void)
{
  Ble_Led_FastToggleCounter = 0U;
  HW_TS_Stop(Ble_Led_Timer_Id);
  if (g_config.led_mode != LED_BLE_STATUS) return;
  BSP_LED_On(LED_BLUE);
}

static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t* p_bd_addr)
{
  uint16_t i =0;
  uint8_t ad_length, ad_type;  
  
  while(i < tab_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
      
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_COMPLETE_LOCAL_NAME:
      {
        static const char bcn_hex[] = "0123456789ABCDEF";
        p_adv_data[i+6] = bcn_hex[(p_bd_addr[1] >> 4) & 0x0F];
        p_adv_data[i+7] = bcn_hex[p_bd_addr[1] & 0x0F];
        p_adv_data[i+8] = bcn_hex[(p_bd_addr[0] >> 4) & 0x0F];
        p_adv_data[i+9] = bcn_hex[p_bd_addr[0] & 0x0F];
        break;
      }
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        p_adv_data[i+2] = ST_MANUF_ID;
        p_adv_data[i+3] = 0x00;
        p_adv_data[i+4] = BLUESTSDK_V2; /* blueST SDK version */
        p_adv_data[i+5] = BOARD_ID_DK_WB1M;//BOARD_ID_DK_WB1M; /* Board ID */
        p_adv_data[i+6] = FW_ID_HEART_RATE; /* FW ID */
        p_adv_data[i+7] = 0x00; /* FW data 1 */
        p_adv_data[i+8] = 0x00; /* FW data 2 */
        p_adv_data[i+9] = 0x00; /* FW data 3 */
        p_adv_data[i+10] = p_bd_addr[5]; /* MSB BD address */
        p_adv_data[i+11] = p_bd_addr[4];
        p_adv_data[i+12] = p_bd_addr[3];
        p_adv_data[i+13] = p_bd_addr[2];
        p_adv_data[i+14] = p_bd_addr[1];
        p_adv_data[i+15] = p_bd_addr[0]; /* LSB BD address */
        break;
      }
    default:
      break;
    }
    i += ad_length + 1; /* increment the iterator to go on next element*/
  }
}
/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * SPECIFIC FUNCTIONS FOR CUSTOM
 *
 *************************************************************/
static void Adv_Cancel(void)
{
  /* USER CODE BEGIN Adv_Cancel_1 */

  /* USER CODE END Adv_Cancel_1 */

  if (BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

    ret = aci_gap_set_non_discoverable();

    BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("** STOP ADVERTISING **  Failed \r\n\r");
    }
    else
    {
      APP_DBG_MSG("  \r\n\r");
      APP_DBG_MSG("** STOP ADVERTISING **  \r\n\r");
    }
  }

  /* USER CODE BEGIN Adv_Cancel_2 */

  /* USER CODE END Adv_Cancel_2 */

  return;
}

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle)
{
  /* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_1 */

  /* USER CODE END BLE_SVC_L2CAP_Conn_Update_1 */

  if (mutex == 1)
  {
    mutex = 0;
    index_con_int = (index_con_int + 1)%SIZE_TAB_CONN_INT;
    uint16_t interval_min = CONN_P(a_ConnInterval[index_con_int]);
    uint16_t interval_max = CONN_P(a_ConnInterval[index_con_int]);
    uint16_t peripheral_latency = L2CAP_PERIPHERAL_LATENCY;
    uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
    tBleStatus ret;

    ret = aci_l2cap_connection_parameter_update_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                    interval_min, interval_max,
                                                    peripheral_latency, timeout_multiplier);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
    }
    else
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully \r\n\r");
    }
  }

  /* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_2 */

  /* USER CODE END BLE_SVC_L2CAP_Conn_Update_2 */

  return;
}
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void Connection_Interval_Update_Req(void)
{
  if (BleApplicationContext.Device_Connection_Status != APP_BLE_FAST_ADV && BleApplicationContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  }

  return;
}
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */
extern volatile uint8_t g_cpu2_state;

void APP_BLE_Key_Button1_Action(void)
{
  /* Ignore spurious EXTI from APPE_Button_Init() firing before BLE stack is up */
  if (g_cpu2_state == 0) return;

