Akustik13/beacon-30mhz/BLE_HR_p2p_Sensor/STM32_WPAN/App/app_ble.c
  /* B1 press: toggle advertising */
  if (BleApplicationContext.Device_Connection_Status == APP_BLE_IDLE) {
    APP_DBG_MSG("B1: start LP advertising\r\n");
    Adv_Request(APP_BLE_LP_ADV);
  } else if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_ADV ||
             BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV) {
    APP_DBG_MSG("B1: stop advertising\r\n");
    Adv_Cancel();
  }
}

/* Restart advertising with current g_config.ble_adv_ms.
   Safe to call from Uart_Cmd_Task: aci_gap_set_non_discoverable and
   aci_gap_set_discoverable use UTIL_SEQ_WaitEvt which spins via __WFI
   and processes IPCC interrupts normally inside a UTIL_SEQ task. */
void APP_BLE_Adv_Restart(void)
{
  if (g_cpu2_state == 0) return;
  APP_BLE_ConnStatus_t st = BleApplicationContext.Device_Connection_Status;
  printf("[BLE] Adv_Restart: st=%u\r\n", (unsigned)st);
  if (st == APP_BLE_LP_ADV || st == APP_BLE_FAST_ADV) {
    tBleStatus r = aci_gap_set_non_discoverable();
    printf("[BLE] non_disc ret=0x%02X\r\n", (unsigned)r);
    BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
    g_ble_advertising = 0;
  }
  if (BleApplicationContext.Device_Connection_Status == APP_BLE_IDLE) {
    Adv_Request(APP_BLE_LP_ADV);
  }
}

void APP_BLE_Adv_Stop(void)
{
  if (g_cpu2_state == 0) { printf("[BLE] Adv_Stop: CPU2 not ready\r\n"); return; }
  APP_BLE_ConnStatus_t st = BleApplicationContext.Device_Connection_Status;
  printf("[BLE] Adv_Stop: st=%u adv=%u\r\n", (unsigned)st, (unsigned)g_ble_advertising);
  if (st != APP_BLE_IDLE && st != APP_BLE_CONNECTED_SERVER) {
    tBleStatus r = aci_gap_set_non_discoverable();
    BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
    g_ble_advertising = 0;
    printf("[BLE] non_disc ret=0x%02X -> IDLE\r\n", (unsigned)r);
    if (g_config.led_mode == LED_BLE_STATUS) {
      HW_TS_Stop(Ble_Led_Timer_Id);
      BSP_LED_Off(LED_BLUE);
    }
  } else {
    printf("[BLE] already IDLE/CONNECTED — nothing to stop\r\n");
  }
}
/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* p_Data)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);

  return;
}

void hci_cmd_resp_release(uint32_t Flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

void hci_cmd_resp_wait(uint32_t Timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

static void BLE_UserEvtRx(void *p_Payload)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *p_param;

  p_param = (tHCI_UserEvtRxParam *)p_Payload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(p_param->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    p_param->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    p_param->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot(HCI_TL_CmdStatus_t Status)
{
  uint32_t task_id_list;
  switch (Status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);
      /* USER CODE BEGIN HCI_TL_CmdBusy */

      /* USER CODE END HCI_TL_CmdBusy */
      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);
      /* USER CODE BEGIN HCI_TL_CmdAvailable */

      /* USER CODE END HCI_TL_CmdAvailable */
      break;

    default:
      /* USER CODE BEGIN Status */

      /* USER CODE END Status */
      break;
  }

  return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
  hci_resume_flow();

  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
